     A          R ACTGLP                    TEXT('MINIMUM PF')
     A            FIELD1         1
     A            FIELD2         5P
     A          K FIELD1
