     FMASTERL1  If   E             DISK
     C                   READ      MASTERL1                               99
     C                   MOVE      '1'           *INLR
