     A          R ACTGLP                    TEXT('MINIMUM PF')
     A            FIELD1         1
     A            FIELD2         5P
     A            FIELD3         7P
     A            FIELD4         9P
     A            FIELD5        10P
     A          K FIELD1
