     A          R ANZFLDR
     A            FILN          10A
     A            LIBN          10A
     A            FLDN          10A
     A            FLDSEQ         4S 0
     A            PFFIL         10A
     A            PFLIB         10A
     A            FILSEQ         4S 0
