     A          R I01800
     A                                      TEXT('Word File for Address Book')
     A            #YDTAI    R               REFFLD(DTAI       F98FRF           )
