     A          R I01800                    PFILE(F01800    )
     A                                      TEXT('LF- #YDTAI ')
     A          K #YDTAI
