       IDENTIFICATION DIVISION.
       PROGRAM-ID.  COMMIO.
       ENVIRONMENT DIVISION.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
           SELECT GENLGR
                  ASSIGN TO FORMATFILE-ACTGLP.
       DATA DIVISION.
       FILE SECTION.
       FD  GENLGR
           LABEL RECORDS ARE OMITTED.
       01  ACTGLP-RCD.
           COPY DDS-ACTGLP OF ACTGLP.
       LINKAGE SECTION.
       01  PARM1               PIC      X(10).
       PROCEDURE DIVISION USING PARM1.
       PARA-1.
           OPEN OUTPUT GENLGR.
           WRITE ACTGLP-RCD.
       COPY ARS334CPY.
           CLOSE GENLGR.
