      * ============================================================ *
      * Object:    HCHKSYN2C       *PGM RPG                          *
      *            Writes an entry in the HCHKSYNMD file for a       *
      *            locked member.                                    *
      *                                                              *
      * Synopsis:  See Command HCHKSYNTGT.                           *
      *                                                              *
      * ------------------------------------------------------------ *
      *             Changes made to this source                      *
      *             ---------------------------                      *
      *                                                              *
      * Date     Who Description                                     *
      * -------- --- ----------------------------------------------- *
      * 20030414 FK  Initial delivery                                *
      * 20111217 FK  Remove HA                                       *
      * ============================================================ *
      * Member descriptions
     FHCHKSYNMD O    E           K DISK
      * ------------------------------------------------------------- *
      * Arrays and tables                                             *
      * ------------------------------------------------------------- *
      * ------------------------------------------------------------- *
      * Data structures                                               *
      * ------------------------------------------------------------- *
      * ------------------------------------------------------------- *
      * Constants                                                     *
      * ------------------------------------------------------------- *
      * ------------------------------------------------------------- *
      * Record format - field renames                                 *
      * ------------------------------------------------------------- *
      * ------------------------------------------------------------- *
      * Key lists                                                     *
      * ------------------------------------------------------------- *
      * ------------------------------------------------------------- *
      * Parameter lists                                               *
      * ------------------------------------------------------------- *
      * Entry parameters
     C     *Entry        PList
     C                   Parm                    MBLIB                          * Library
     C                   Parm                    MBFILE                         * File
     C                   Parm                    MBNAME                         * Member name
      * ------------------------------------------------------------- *
      * Main line                                                     *
      * ------------------------------------------------------------- *
      * Initialise
     C                   MoveL     'Y'           MBLOCK                         * Member Locked?
     C                   Write     SYNMD@

     C                   Seton                                        LR
      * ------------------------------------------------------------------- *
      * Compile-time tables                                                 *
      * ------------------------------------------------------------------- *
